# ElementSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementSetIterator Class
Members See Also
---
An iterator to an element set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ElementSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ElementSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ElementSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ElementSetIterator
# See Also
ElementSetIterator Members
Autodesk.Revit.DB Namespace